doc/input/img/fep_config_distribution.dot
/**
 *
 * Image of the config distribution
 *
 * @file
 * Copyright @ 2019 Audi AG. All rights reserved.
 * 
 *     This Source Code Form is subject to the terms of the Mozilla
 *     Public License, v. 2.0. If a copy of the MPL was not distributed
 *     with this file, You can obtain one at https://mozilla.org/MPL/2.0/.
 * 
 * If it is not possible or desirable to put the notice in a particular file, then
 * You may include the notice in a location (such as a LICENSE file in a
 * relevant directory) where a recipient would be likely to look for such a notice.
 * 
 * You may add additional accurate notices of copyright ownership.
 *
 */

digraph fep_property_distribution {
    graph [layout="sfdp"];
    node [shape = "box"];

    Master                 [label="Master"]
    Master->ModuleAlbrecht [label="ui32EgoId=245" color="lightgray"]
    Master->ModuleBert     [label="ui32EgoId=245" color="lightgray"]
    Master->ModuleCarl     [label="ui32EgoId=245" color="lightgray"]
    Master->ModuleDavid    [label="ui32EgoId=245\nui32CycleTime=100" color="lightgray"]
    
    ModuleAlbrecht         [label="Albrecht"]
    ModuleBert             [label="Bert"]
    ModuleCarl             [label="Carl"]
    ModuleDavid            [label="David"]
}
